app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 10 OFFSET 0  [["author_id", 2]]
---
	def index #@posts = Post.order(created_at: :desc).page(params[:page])
    @posts = Post.order(:author_id).page(params[:page])